### Pandas
- 데이터 분석을 위한 사용이 쉽고 성능이 좋은 오픈소스 python 라이브러리
- R과 pandas의 특징
    - R보다 pandas 가 학습이 쉽다.
    - R보다 pandas가 성능이 좋다.
    - R보다 Python은 활용할수 있는 분야가 많다
- 크게 두가지 데이터 타입을 사용합니다.
    - Series : index와 value로 이루어진 데이터 타입
    - DataFrame : index, colume, value로 이루어진 데이터 타입

### 1.Series
- 동일한 데이터 타입의 값을 갖습니다.

In [1]:
# Series value 만 설정하면  index는 0부터 자동으로 설정
data = pd.Series(np.random.randint(10,size= 5))
data

0    7
1    3
2    8
3    7
4    3
dtype: int32

In [3]:
#index 설정
data = pd.Series(np.random.randint(10,size=5),index = list("ABCDE"))
data

A    5
B    1
C    0
D    3
E    6
dtype: int32

In [4]:
data.index,data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([5, 1, 0, 3, 6]))

In [5]:
data["B"],data.B

(1, 1)

In [8]:
data["C"]=10
data

A     5
B     1
C    10
D     3
E     6
dtype: int32

In [10]:
#브로드 캐스팅
data *10

A     50
B     10
C    100
D     30
E     60
dtype: int32

In [12]:
data[["B","E"]]

B    1
E    6
dtype: int32

In [13]:
#offset index
data[2::2]

C    10
E     6
dtype: int32

In [14]:
data[::-1]

E     6
D     3
C    10
B     1
A     5
dtype: int32

In [16]:
data2 = pd.Series({"D":3,"E":5,"F":7})
data2

D    3
E    5
F    7
dtype: int64

In [17]:
result = data +data2
result

A     NaN
B     NaN
C     NaN
D     6.0
E    11.0
F     NaN
dtype: float64

In [20]:
result[result.isnull()]=data
result[result.isnull()]=data2
result

A     5.0
B     1.0
C    10.0
D     6.0
E    11.0
F     7.0
dtype: float64

### 2.DataFrame
- 데이터 프레임은 여러개의 Series로 구성
- 같은 컬럼에 있는 value값은 같은 데이터 타입을 갖습니다.

In [21]:
# 데이터 프레임 생성 1: 딕셔너리의 리스트

In [22]:
datas= {
    "name":["dss","fcamp"],
    "email":["dss@gmail.com","fcamp@daum.net"],
}
datas

{'name': ['dss', 'fcamp'], 'email': ['dss@gmail.com', 'fcamp@daum.net']}

In [23]:
df = pd.DataFrame(datas)

In [24]:
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [25]:
# 데이터 프레임 생성 2: 리스트의 딕셔너리

In [28]:
datas= [ {"name":"dss","email":"dss@gmail.com"},
    {"name":"fcamp","email":"fcamp@daum.net"},]
datas

[{'name': 'dss', 'email': 'dss@gmail.com'},
 {'name': 'fcamp', 'email': 'fcamp@daum.net'}]

In [30]:
df = pd.DataFrame(datas,index=["one","two"])
df

      name           email
one    dss   dss@gmail.com
two  fcamp  fcamp@daum.net

In [31]:
df.index

Index(['one', 'two'], dtype='object')

In [32]:
df.columns

Index(['name', 'email'], dtype='object')

In [33]:
df.values

array([['dss', 'dss@gmail.com'],
       ['fcamp', 'fcamp@daum.net']], dtype=object)

In [35]:
#데이터 프레임에서 데이터의 선택 : row,colunm,(row,cloumn)

In [36]:
#row 선택
datas= [ {"name":"dss","email":"dss@gmail.com"},
    {"name":"fcamp","email":"fcamp@daum.net"},]
df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [38]:
df.loc[1]["email"]

'fcamp@daum.net'

In [39]:
#index가 있으면 수정 없으면 추가
df.loc[2] = {"name":"andy","email":"andy@naver.com"}
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [40]:
#column 선택
df["name"]

0      dss
1    fcamp
2     andy
Name: name, dtype: object

In [41]:
df["id"] = ""

In [42]:
df

    name           email id
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [44]:
df["id"] = range(1,4) #np.arange(1,4)
df

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [45]:
#row,colume 선택
df.loc[[0,2],["email","id"]]

            email  id
0   dss@gmail.com   1
2  andy@naver.com   3

In [46]:
#컬럼 데이터 순서 설정
df[["id","name","email"]]

   id   name           email
0   1    dss   dss@gmail.com
1   2  fcamp  fcamp@daum.net
2   3   andy  andy@naver.com

In [47]:
#head,tail
df.head(2)

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2

In [48]:
DF.TAIL(2)

NameError: name 'DF' is not defined

In [49]:
df.tail(2)

    name           email  id
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

### 3.apply 함수
- map 함수와 비슷

In [51]:
#email 컬럼에서 메일의 도메인만 가져와서 새로운 domail 컬럼을 생성
df

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [57]:
def domain(email):
    return email.split("@")[1].split(".")[0]

domain(df.loc[0]["email"])

'gmail'

In [59]:
df["domain"] = df["email"].apply(domain)
df

    name           email  id domain
0    dss   dss@gmail.com   1  gmail
1  fcamp  fcamp@daum.net   2   daum
2   andy  andy@naver.com   3  naver

In [60]:
from makedata import *

In [62]:
get_name()

'Andrew'

In [63]:
get_age()

40

In [77]:
df1 = pd.DataFrame(make_data(5))
df2 = pd.DataFrame(make_data(5))

### 4. append

In [78]:
df3 = df1.append(df2)
df3[2:7]

   Age     Name
2   26     Adam
3   35   Anchal
4   27  Anthony
0   36      Jin
1   22    Billy

In [83]:
#reset_index 인덱스 재정렬
df3.reset_index(drop=True,inplace=True)
df3.tail(2)

   Age    Name
8   31    Adam
9   40  Andrew

In [82]:
df3=df1.append(df2,ignore_index=True)
df3.tail(2)

   Age    Name
8   31    Adam
9   40  Andrew

### 5. concat
- row 나 column으로 데이터 프레임을 합칠때 사용

In [85]:
df3=pd.concat([df1,df2]).reset_index(drop=True)

In [86]:
df3

   Age     Name
0   33   Anchal
1   25  Anthony
2   26     Adam
3   35   Anchal
4   27  Anthony
5   36      Jin
6   22    Billy
7   38    Billy
8   31     Adam
9   40   Andrew

In [87]:
pd.concat([df3,df1],axis=1)

   Age     Name   Age     Name
0   33   Anchal  33.0   Anchal
1   25  Anthony  25.0  Anthony
2   26     Adam  26.0     Adam
3   35   Anchal  35.0   Anchal
4   27  Anthony  27.0  Anthony
5   36      Jin   NaN      NaN
6   22    Billy   NaN      NaN
7   38    Billy   NaN      NaN
8   31     Adam   NaN      NaN
9   40   Andrew   NaN      NaN

In [88]:
pd.concat([df3,df1],axis=1,join="inner")

   Age     Name  Age     Name
0   33   Anchal   33   Anchal
1   25  Anthony   25  Anthony
2   26     Adam   26     Adam
3   35   Anchal   35   Anchal
4   27  Anthony   27  Anthony

In [89]:
df=pd.DataFrame(make_data())
df

   Age     Name
0   25  Anthony
1   21    Billy
2   27    Billy
3   28     Alan
4   27  Anthony
5   26  Anthony
6   33     Alex
7   35   Anchal
8   29   Andrew
9   31   Andrew

In [94]:
#size
result_df = df.groupby("Name").size().reset_index(name="count")
result_df

      Name  count
0     Alan      1
1     Alex      1
2   Anchal      1
3   Andrew      2
4  Anthony      3
5    Billy      2

In [96]:
#sort_values : 설정한 컬럼으로 데이터 프레임을 정렬
result_df.sort_values(["count","Name"],ascending=False, inplace=True)
result_df.reset_index(drop=True,inplace=True)
result_df

      Name  count
0  Anthony      3
1    Billy      2
2   Andrew      2
3   Anchal      1
4     Alex      1
5     Alan      1

In [97]:
#agg
#size(),max(),min()meam()

In [98]:
df.groupby("Name").agg("min").reset_index()

      Name  Age
0     Alan   28
1     Alex   33
2   Anchal   35
3   Andrew   29
4  Anthony   25
5    Billy   21

In [99]:
#데이터르 요약해서 보여주는 함수
df.describe()

             Age
count  10.000000
mean   28.200000
std     4.049691
min    21.000000
25%    26.250000
50%    27.500000
75%    30.500000
max    35.000000

### 7.Merge = sql(join)
- 두개 이상의 데이터 프레임을 합쳐서 결과를 출력하는 방법